[
  {
    "Week": 1,
    "Stage": 1,
    "ContentPoint": [
      "Throw balls and objects of various shapes and sizes underarm and overarm towards a target."
    ],
    "Skills": [
      {
        "Skill": "Javelin Throwing",
        "Description": "Students learn to grip the javelin near the base using a handshake grip, aligning it with the arm and shoulder. Proper stance involves standing with feet shoulder-width apart, leading with the leg opposite the throwing arm. Focus on a smooth arm motion and release.",
        "Activity": {
          "Activity Name": "Javelin Throwing",
          "Set Up": [
            "Mark throwing lines using cones or markers spaced 3 to 5 meters apart to ensure safety."
          ],
          "Practice": [
            "In pairs, students take turns performing throws, focusing on technique, aiming for distance while maintaining control and balance.",
            "Use soft javelins for safety."
          ],
          "Assessment": [
            "Observe students' grip and release action, checking for a straight strong follow-through and proper stance."
          ],
          "Equipment": "Soft javelins, cones, markers"
        }
      },
      {
        "Skill": "Shot-put Techniques",
        "Description": "Students use a 'clean palm grip,' holding the ball near the neck. Using a sideways positioning, they push the ball out through the arm extending straight and maintain a stable lower body.",
        "Activity": {
          "Activity Name": "Shot-put",
          "Set Up": [
            "Create a circle on the ground for shot-put activities with clear boundaries to ensure safety, about 2-meter in diameter."
          ],
          "Practice": [
            "Students practice 'pushing' the ball from their neck area, focusing on leg and arm coordination.",
            "Use bean bags or light stuffed balls to simulate shot-put for safety."
          ],
          "Assessment": [
            "Check students' stance and release action, observing the follow-through and stability."
          ],
          "Equipment": "Bean bags, light stuffed balls, cones"
        }
      }
    ]
  },
  {
    "Week": 2,
    "Stage": 1,
    "ContentPoint": [
      "Dribble a ball at different levels (e.g., hand dribble, foot dribble).",
      "Apply fundamental movement skills to create and participate in physically active games."
    ],
    "Skills": [
      {
        "Skill": "Mini Soccer",
        "Description": "Students practice fundamental soccer skills including dribbling, passing, and basic ball control using feet only. Focus on keeping the ball close to feet, looking up while dribbling, and using inside of foot for control and accuracy.",
        "Activity": {
          "Activity Name": "Mini Soccer",
          "Set Up": [
            "Create smaller playing fields (approximately 20m x 15m) with cone goals.",
            "Use size 3 soccer balls and organise teams of 5-6 players per side."
          ],
          "Practice": [
            "Practice dribbling through cone courses, passing in pairs, and small-sided games focusing on ball control rather than competition.",
            "Rotate positions regularly."
          ],
          "Assessment": [
            "Observe ball control technique, ability to pass accurately using inside of foot, and spatial awareness during game situations."
          ],
          "Equipment": "Size 3 soccer balls, cones"
        }
      },
      {
        "Skill": "Scooter Ball",
        "Description": "Students develop balance, coordination, and ball handling skills while seated on scooters. Focus on safe scooter movement, proper ball handling with hands, and teamwork strategies while maintaining balance.",
        "Activity": {
          "Activity Name": "Scooter Ball",
          "Set Up": [
            "Clear playing area with boundary cones.",
            "Set up goals using cones or small targets.",
            "Ensure scooters are in good condition and students understand safety rules."
          ],
          "Practice": [
            "Students practice moving on scooters while controlling a ball with hands, passing to teammates, and playing modified games.",
            "emphasise safety and controlled movements."
          ],
          "Assessment": [
            "Check students' balance on scooters, ball handling skills, safe movement patterns, and ability to work cooperatively with teammates."
          ],
          "Equipment": "Scooters, balls, cones"
        }
      }
    ]
  },
  {
    "Week": 3,
    "Stage": 1,
    "ContentPoint": [
      "Apply fundamental movement skills to create and participate in physically active games."
    ],
    "Skills": [
      {
        "Skill": "Ball Game - Over and Under",
        "Description": "Students practice passing a ball over their heads and under their legs in a team line formation. This develops coordination, timing, and teamwork. Players must communicate and maintain steady rhythm while handling the ball safely.",
        "Activity": {
          "Activity Name": "Ball Game - Over and Under",
          "Set Up": [
            "Arrange students in teams of 6-8 in straight lines, with arms length spacing between each player.",
            "Mark start and finish lines with cones."
          ],
          "Practice": [
            "First player passes ball overhead to the next player, who passes it under their legs to the third player, continuing the over-under pattern.",
            "When the ball reaches the back, that player runs to the front and starts again.",
            "Practice with different sized balls."
          ],
          "Assessment": [
            "Observe students' ball handling technique, communication with teammates, and ability to maintain the over-under sequence without dropping the ball."
          ],
          "Equipment": "Various sized balls, cones"
        }
      },
      {
        "Skill": "Hoop Hop - Scissor Paper Rock",
        "Description": "Students hop on two feet through hoops, practicing coordination and balance and playing scissors-paper-rock when they meet. Winner continues on, next player from opposing team enters.",
        "Activity": {
          "Activity Name": "Hoop Hop - Scissor Paper Rock",
          "Set Up": [
            "Lane/s of hoops, with enough space for hopping."
          ],
          "Practice": [
            "Start with basic two-foot hopping through hoops.",
            "Quick recap of scissors-paper-rock rules."
          ],
          "Assessment": [
            "Check students' hopping ability to maintain balance, and coordination for rapid stop and start."
          ],
          "Equipment": "Hoops"
        }
      }
    ]
  },
  {
    "Week": 4,
    "Stage": 1,
    "ContentPoint": [
      "Run and sprint, varying pace according to purpose.",
      "Throw balls and objects of various shapes and sizes underarm and overarm towards a target.",
      "Apply fundamental movement skills to create and participate in physically active games."
    ],
    "Skills": [
      {
        "Skill": "Bean Bag Relay Races",
        "Description": "Students practice running technique while carrying bean bags, focusing on proper running form, quick transitions, and team cooperation. Emphasis on maintaining speed while safely handling the bean bag and executing clean handoffs.",
        "Activity": {
          "Activity Name": "Bean Bag Relay Race",
          "Set Up": [
            "Create relay courses with cones marking start/finish lines and turning points.",
            "Place hoops or targets 15-20 meters from start line.",
            "organise teams of 4-6 students."
          ],
          "Practice": [
            "Students run with bean bag to designated hoop, place it inside, run back to tag next teammate.",
            "Variations include carrying bean bag on head, balancing on different body parts, or obstacle courses."
          ],
          "Assessment": [
            "Observe running technique, safe bean bag handling, proper tagging of teammates, and adherence to relay rules."
          ],
          "Equipment": "Bean bags, cones, hoops"
        }
      },
      {
        "Skill": "Bean Bag in a Hoop",
        "Description": "Students develop underarm throwing accuracy by aiming bean bags at hoops of varying distances. Focus on proper stance, smooth underarm motion, and follow-through while maintaining accuracy over power.",
        "Activity": {
          "Activity Name": "Bean Bag in a Hoop",
          "Set Up": [
            "Place 3 hoops at different distances (5m, 8m, 12m) with point values (closest = 1 point, middle = 2 points, furthest = 3 points).",
            "Mark throwing line clearly."
          ],
          "Practice": [
            "Students take turns throwing bean bags, aiming for hoops to score points.",
            "Each student gets 3 throws per round.",
            "Keep team scores and rotate through different throwing positions."
          ],
          "Assessment": [
            "Check underarm throwing technique, accuracy progression, and students' ability to adjust force for different distances."
          ],
          "Equipment": "Bean bags, hoops, markers"
        }
      }
    ]
  },
  {
    "Week": 5,
    "Stage": 1,
    "ContentPoint": [
      "Run and sprint, varying pace according to purpose.",
      "Demonstrate and explain how fair play and rules contribute to safety in group activities.",
      "Apply fundamental movement skills to create and participate in physically active games."
    ],
    "Skills": [
      {
        "Skill": "Tug-o-War",
        "Description": "Students learn proper rope grip, body positioning, and teamwork strategies. Focus on synchronised pulling, maintaining low body position, and working together as a coordinated unit while emphasising safety.",
        "Activity": {
          "Activity Name": "Tug-o-War",
          "Set Up": [
            "Use appropriate rope with clear centre marking and boundary lines 2 meters from centre on each side.",
            "Ensure soft ground surface and adequate space around playing area."
          ],
          "Practice": [
            "Teams of equal numbers practice proper grip (hands alternating, rope under arm), body positioning (low stance, feet apart), and coordinated pulling.",
            "Rotate team compositions for fairness."
          ],
          "Assessment": [
            "Observe proper grip technique, body positioning, teamwork coordination, and adherence to safety rules during competition."
          ],
          "Equipment": "Tug-o-war rope, boundary markers"
        }
      },
      {
        "Skill": "Relay Running with Sprints and Running Technique",
        "Description": "Students focus on proper sprinting form including arm swing, leg drive, and body posture. Practice baton handoffs and maintain speed through transitions while demonstrating efficient running mechanics.",
        "Activity": {
          "Activity Name": "Relay Running",
          "Set Up": [
            "Mark 50-meter track with clear lanes and exchange zones.",
            "Use batons or bean bags for handoffs.",
            "Create teams of 4 runners each."
          ],
          "Practice": [
            "Practice individual sprinting technique focusing on arm drive, high knees, and forward lean.",
            "Then practice baton exchanges in stationary and moving positions before full relay races."
          ],
          "Assessment": [
            "Evaluate sprinting technique, smooth baton exchanges, maintaining speed through handoff zones, and overall relay race execution."
          ],
          "Equipment": "Batons, bean bags, cones, lane markers"
        }
      }
    ]
  },
  {
    "Week": 6,
    "Stage": 1,
    "ContentPoint": [
      "Identify and participate in physical activities to enhance enjoyment and motivation.",
      "Fundamental movement skills support health and wellbeing:"
    ],
    "Skills": [
      {
        "Skill": "Athletics Carnival",
        "Description": "Students participate in mini-events practising the accumulated skills from previous weeks. Focus on enjoyment, participation, and demonstrating learned techniques in a fun, supportive environment.",
        "Activity": {
          "Activity Name": "Carnival Preparation",
          "Set Up": [
            "Set up multiple stations around the area including mini-javelin throws, shot-put areas, relay race tracks, jumping contests, and dodging/sidestepping game zones."
          ],
          "Practice": [
            "Students rotate through different mini-events practising skills learned in previous weeks.",
            "Events include mini-javelin throws, shot-put, relay races, jumping contests, dodging, and sidestepping games."
          ],
          "Assessment": [
            "Collective assessment of skills through participation, enjoyment, and enthusiasm during mini-events.",
            "Focus on effort and application of learned techniques rather than competition."
          ],
          "Equipment": "Various equipment from previous weeks, cones, markers"
        }
      }
    ]
  },
  {
    "Week": 7,
    "Stage": 1,
    "ContentPoint": [
      "Apply fundamental movement skills to create and participate in physically active games.",
      "Demonstrate and explain how fair play and rules contribute to safety in group activities."
    ],
    "Skills": [
      {
        "Skill": "Traffic Light Tag",
        "Description": "Team-based tag game where designated taggers control the pace of movement by calling out traffic light signals, with tagged players becoming new traffic controllers. Develops listening skills, reaction time, and spatial awareness.",
        "Activity": {
          "Activity Name": "Traffic Light Tag",
          "Set Up": [
            "Mark clear boundaries of the playing area using cones.",
            "Select 2-3 students to start as traffic controllers (taggers).",
            "Give traffic controllers coloured bibs or markers to identify them.",
            "Ensure adequate space for safe running and stopping."
          ],
          "Practice": [
            "Traffic controllers call out 'green light' for running, 'yellow light' for slow walking, or 'red light' for complete freeze.",
            "All other players must immediately respond to the traffic signals while avoiding being tagged.",
            "When tagged during 'green light' or 'yellow light' phases, players become new traffic controllers.",
            "Original traffic controllers can rejoin as regular players after tagging someone.",
            "Game continues with new traffic controllers taking charge of signals."
          ],
          "Assessment": [
            "Observe students' ability to quickly respond to auditory signals and change movement speed.",
            "Evaluate listening skills and reaction time during signal changes.",
            "Assess students' spatial awareness and ability to avoid collisions during different movement phases."
          ],
          "Equipment": "Cones, coloured bibs or markers"
        }
      },
      {
        "Skill": "Team Ball Pass",
        "Description": "Cooperative circle game where teams coordinate to pass multiple balls simultaneously in different directions, requiring timing and communication to prevent collisions. Develops hand-eye coordination and teamwork.",
        "Activity": {
          "Activity Name": "Team Ball Pass",
          "Set Up": [
            "Divide students into teams of 8-12 players each.",
            "Have each team form a circle with players standing arm's length apart.",
            "Provide 2-4 different coloured balls for each team.",
            "Use cones to mark team circle positions if needed."
          ],
          "Practice": [
            "Start with one ball being passed clockwise around the circle.",
            "Add a second ball going counter-clockwise once the rhythm is established.",
            "Introduce additional balls in alternating directions.",
            "Teams focus on timing, gentle passes, and clear communication.",
            "Challenge teams to see how many balls they can keep moving without dropping any.",
            "Reset and try again if balls collide or are dropped."
          ],
          "Assessment": [
            "Observe students' hand-eye coordination and catching/throwing accuracy.",
            "Evaluate teamwork and communication during multi-ball coordination.",
            "Assess students' ability to maintain focus and timing under increasing complexity."
          ],
          "Equipment": "Balls (different colours), cones"
        }
      }
    ]
  },
  {
    "Week": 8,
    "Stage": 1,
    "ContentPoint": [
      "Apply fundamental movement skills to create and participate in physically active games.",
      "Demonstrate and explain how fair play and rules contribute to safety in group activities."
    ],
    "Skills": [
      {
        "Skill": "Bucket Freeze",
        "Description": "Strategic team game where one team attempts to throw balls into a bucket while the other team sends runners around a circuit. Successfully landing a ball freezes the runner, adding tactical elements to throwing accuracy and running speed.",
        "Activity": {
          "Activity Name": "Bucket Freeze",
          "Set Up": [
            "Set up a throw line for Team A and a circuit course for Team B.",
            "Place bucket at appropriate distance from throw line.",
            "Mark clear circuit boundaries with cones."
          ],
          "Practice": [
            "Team A stands behind throw line attempting to throw balls into bucket.",
            "Team B sends one runner at a time around circuit.",
            "If Team A lands a ball in bucket, Team B runner must freeze.",
            "Next runner can free frozen runners by tagging them.",
            "Team with most players completing laps wins."
          ],
          "Assessment": [
            "Observe throwing accuracy, strategic thinking, and teamwork coordination.",
            "Assess running technique and spatial awareness during circuit completion."
          ],
          "Equipment": "Cones, balls, bucket"
        }
      },
      {
        "Skill": "Rob the Nest",
        "Description": "Multi-team collection game where teams gather items for their nest while also strategically stealing from other teams' collections. Develops running speed, decision-making, and competitive strategy.",
        "Activity": {
          "Activity Name": "Rob the Nest",
          "Set Up": [
            "Place various items (bean bags, balls, cones) in centre area.",
            "Set up team 'nests' using hoops around the playing area.",
            "Ensure equal distance from centre to each nest."
          ],
          "Practice": [
            "Teams run to centre to collect items for their nest.",
            "Teams can also steal from other teams' nests.",
            "Game continues for set time period.",
            "Team with most items in their nest wins."
          ],
          "Assessment": [
            "Evaluate running technique, strategic decision-making, and fair play.",
            "Observe students' ability to adapt tactics based on game situation."
          ],
          "Equipment": "Cones, bean bags, hoops, various small items"
        }
      }
    ]
  },
  {
    "Week": 9,
    "Stage": 1,
    "ContentPoint": [
      "Apply fundamental movement skills to create and participate in physically active games.",
      "Demonstrate and explain how fair play and rules contribute to safety in group activities."
    ],
    "Skills": [
      {
        "Skill": "Ultimate Ball",
        "Description": "Modified version of Ultimate Frisbee played with a ball. Players must pass to teammates without dropping the ball, with no running allowed while holding it. Develops passing accuracy, catching skills, and team strategy.",
        "Activity": {
          "Activity Name": "Ultimate Ball",
          "Set Up": [
            "Mark playing field with clear boundaries and goal areas at each end.",
            "Divide students into two equal teams.",
            "Use soft ball or vortex for safety."
          ],
          "Practice": [
            "Teams pass ball between teammates without dropping it, working together to move ball towards goal area.",
            "No running while holding ball.",
            "Focus on accurate passing, catching, and strategic positioning."
          ],
          "Assessment": [
            "Observe passing and catching technique, spatial awareness, and team strategy.",
            "Evaluate communication and cooperation during gameplay."
          ],
          "Equipment": "Soft ball or vortex"
        }
      },
      {
        "Skill": "Pin Guard",
        "Description": "Strategic defence and attack game where teams guard their cone (pin) while attempting to knock over opponents' pins using dodgeballs. Combines throwing accuracy with defensive positioning skills.",
        "Activity": {
          "Activity Name": "Pin Guard",
          "Set Up": [
            "Place one cone (pin) for each team in designated areas around playing space.",
            "Provide dodgeballs in centre area.",
            "Ensure adequate space between team areas for safety."
          ],
          "Practice": [
            "Each team guards their pin while trying to knock over other teams' pins using dodgeballs.",
            "If team's pin falls, they are eliminated.",
            "emphasise accuracy over power and fair play."
          ],
          "Assessment": [
            "Check throwing accuracy, defensive positioning, and strategic thinking.",
            "Observe teamwork in both offence and defence situations."
          ],
          "Equipment": "Cones, dodgeballs"
        }
      }
    ]
  },
  {
    "Week": 10,
    "Stage": 1,
    "ContentPoint": [
      "Demonstrate spatial awareness in relation to people, objects, and the environment.",
      "Apply fundamental movement skills to create and participate in physically active games."
    ],
    "Skills": [
      {
        "Skill": "Numbers Game",
        "Description": "Fast-paced reaction game where students are assigned numbers and must respond quickly to teacher calls combining their number with specific equipment and actions. Develops reaction time, decision-making, and various movement skills.",
        "Activity": {
          "Activity Name": "Numbers Game",
          "Set Up": [
            "Set up range of balls, bats, and equipment in centre area.",
            "Divide teams into two groups with each player assigned a number.",
            "Create goal areas for each team."
          ],
          "Practice": [
            "Teacher calls out a number and specific equipment/action (e.g., '3, hockey').",
            "Corresponding players from each team race to equipment and attempt to score using specified activity.",
            "Rotate through different numbers and activities."
          ],
          "Assessment": [
            "Evaluate reaction time, ability to follow complex instructions, and skill application under pressure.",
            "Observe spatial awareness and strategic thinking during competitive situations."
          ],
          "Equipment": "Ball, cones, number tags or bibs"
        }
      },
      {
        "Skill": "Clean Up the Yard",
        "Description": "High-energy throwing game where teams attempt to clear their area by throwing soft balls over a central line while preventing accumulation on their side. Develops throwing technique and teamwork under time pressure.",
        "Activity": {
          "Activity Name": "Clean Up the Yard",
          "Set Up": [
            "Divide playing area in half with clear central line.",
            "Distribute soft footballs evenly on both sides.",
            "Mark boundaries to ensure throws stay within playing field."
          ],
          "Practice": [
            "Teams throw bean bags or soft balls over central line to opponent's side.",
            "Team with fewest balls on their side after 5 minutes wins.",
            "Overthrows don't count and balls must land within field boundaries."
          ],
          "Assessment": [
            "Observe throwing technique, accuracy, and teamwork.",
            "Evaluate students' ability to work under time pressure while maintaining control and strategy."
          ],
          "Equipment": "Soft footballs"
        }
      }
    ]
  }
]